import { TFaculty } from "../types";

const FacultyDetails: Array<TFaculty> = [
  {
    id: "1",
    name: "คณะวิศวกรรมศาสตร์",
    detail: `คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็นคณะวิศวกรรมศาสตร์ในประเทศไทยที่เก่าแก่ที่สุด และเป็น 1 ใน 4 คณะแรกตั้งของจุฬาลงกรณ์มหาวิทยาลัย ถือกำเนิดมาจากโรงเรียนยันตรศึกษาแห่งโรงเรียนข้าราชการพลเรือนของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ถือเป็นคณะที่มีจำนวนรุ่นมากที่สุดในจุฬาลงกรณ์มหาวิทยาลัย โดยในปีการศึกษา 2567 เป็นรุ่นที่ 108 คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย มีหน้าที่หลักในการผลิตบัณฑิตวิศวกรรมศาสตร์ทั้งในระดับปริญญาบัณฑิตและบัณฑิตศึกษา ศึกษาวิจัยและพัฒนาองค์ความรู้ทางวิศวกรรมศาสตร์และเผยแพร่องค์ความรู้สู่ประชาชนทั่วไป เพื่อเป็นที่พึ่งพิงทางวิชาการให้กับประเทศ มีงานวิจัยและความร่วมมือทางวิชาการซึ่งเป็นที่ยอมรับในระดับชาติและระดับนานาชาติ ปัจจุบันมีภาควิชาทั้งหมด 12 ภาควิชาและหน่วยงานเทียบเท่าภาควิชาอีก 2 หน่วยงาน นิสิตคณะวิศวกรรมศาสตร์ มักเรียกแทนตัวเองว่า "อินทาเนีย" - คณะวิศวกรรมศาสตร์ตั้งอยู่ในพื้นที่จุฬาลงกรณ์มหาวิทยาลัยฝั่งถนนอังรีดูนังต์ ด้านข้างหอประชุมจุฬาลงกรณ์มหาวิทยาลัย`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-engineering-hero-desktop-1024x640.jpg",
  },
  {
    id: "2",
    name: "คณะครุศาสตร์",
    detail: `ถือกำเนิดมาจากแนวคิดของ โรงเรียนฝึกหัดครู โดยการพัฒนาหลักสูตรผลิตครูของโรงเรียนข้าราชการพลเรือน และเป็นแผนกวิชาหนึ่งในคณะอักษรศาสตร์และวิทยาศาสตร์ พร้อมกับการสถาปนาจุฬาลงกรณ์มหาวิทยาลัย ได้มีพระราชกฤษฎีกาจัดตั้งเป็นคณะครุศาสตร์ เมื่อวันที่ 10 กรกฎาคม พ.ศ. 2500 นับเป็นคณะที่ 7 ของจุฬาลงกรณ์มหาวิทยาลัย`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2017/11/chula-faculty-education-hero-desktop-1024x640.jpg",
  },
  {
    id: "3",
    name: "คณะนิติศาสตร์",
    detail: `คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย มีวิวัฒนาการสืบเนื่องมานับตั้งแต่ พ.ศ. 2476 กล่าวคือ ก่อนหน้านั้นพระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัวมีพระราชดำริว่า นิติศึกษา ณ โรงเรียนกฎหมาย กระทรวงยุติธรรมได้เจริญยิ่งขึ้นเป็นลำดับมา และมีผลประจักษ์ว่าได้บรรลุถึงขีดวิชาขั้นมหาวิทยาลัยในอารยประเทศแล้ว เป็นการสมควรที่จะบำรุงต่อไปในทำนองมหาวิทยาลัย จึงทรงพระกรุณาโปรดเกล้าฯ ให้ประสานระเบียบการศึกษานิติศาสตร์เข้ากับมหาวิทยาลัยเป็นคณะวิชาคณะหนึ่ง และได้มีประกาศพระบรมราชโองการ ลงวันที่ 25 เมษายน พ.ศ. 2476 จัดตั้งคณะขึ้นมีชื่อเรียกว่า คณะนิติศาสตร์และรัฐศาสตร์
ปัจจุบัน คณะนิติศาสตร์ ตั้งอยู่ทางฝั่งตะวันตกของถนนพญาไท (เยื้องกับคณะพาณิชยศาสตร์และการบัญชี) ในพื้นที่บริเวณเดียวกับคณะนิเทศศาสตร์ โดยมีอาคารทำการของคณะสองอาคาร คือ อาคารเทพทวาราวดี เป็นอาคารที่ทำการ นอกจากนี้ยังมี อาคารพินิตประชานาถ ซึ่งเป็นอาคารเรียนส่วนกลาง ใช้ร่วมกับคณะนิเทศศาสตร์
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-law-hero-desktop-1024x640.jpg",
  },
  {
    id: "4",
    name: "คณะนิเทศศาสตร์",
    detail: `จุฬาลงกรณ์มหาวิทยาลัยได้เปิดสอนวิชาการหนังสือพิมพ์ขึ้นตั้งแต่ พ.ศ. 2482 ซึ่งเป็นหลักสูตรในระดับอนุปริญญา สังกัดในคณะอักษรศาสตร์และวิทยาศาสตร์ หลังจากนั้นในปี พ.ศ. 2497 ได้มีการโอนการศึกษาวิชาการหนังสือพิมพ์จากจุฬาลงกรณ์มหาวิทยาลัย ไปทำการสอนที่มหาวิทยาลัยวิชาธรรมศาสตร์และการเมือง โดยได้เปิดสอนในระดับปริญญาตรี ซึ่งเป็นการสิ้นสุดการสอนในสาขานิเทศศาสตร์ในจุฬาลงกรณ์มหาวิทยาลัยตั้งแต่นั้นมา
จุฬาลงกรณ์มหาวิทยาลัยได้จัดการเรียนการสอนในสาขาวิชานิเทศศาสตร์อีกครั้งในแผนกสื่อสารมวลชนและการประชาสัมพันธ์ สังกัดอยู่กับคณะรัฐศาสตร์ เมื่อวันที่ 5 กรกฎาคม พ.ศ. 2508 ดังนั้น จึงถือเอาวันที่ 5 กรกฎาคมของทุกปี เป็นวันคล้ายวันสถาปนาคณะนิเทศศาสตร์ หลักจากนั้น ในปี พ.ศ. 2509 ได้พระราชกฤษฎีกาจัดตั้ง "แผนกสื่อสารมวลชนและการประชาสัมพันธ์" ซึ่งเป็นแผนกอิสระ มีฐานะเทียบเท่าคณะหนึ่งในจุฬาลงกรณ์มหาวิทยาลัย โดยมีสีน้ำเงิน (Royal Blue) เป็นสีประจำแผนกอิสระฯ เนื่องจากสีน้ำเงินเป็นสีแทนน้ำหมึก และมีสัญลักษณ์เป็นสังข์แตร
ในเวลาต่อมาจึงได้รับการยกฐานะขึ้นเป็น "คณะนิเทศศาสตร์" เมื่อปี พ.ศ. 2517 นับเป็นคณะที่ 14 ของจุฬาลงกรณ์มหาวิทยาลัย โดยมี ศาสตราจารย์บำรุงสุข สีหอำไพ เป็นคณบดีคนแรก
ปัจจุบันคณะนิเทศศาสตร์ ตั้งอยู่ทางฝั่งตะวันตกของถนนพญาไท (ตรงข้ามกับคณะวิทยาศาสตร์) ในพื้นที่บริเวณเดียวกับคณะนิติศาสตร์ โดยมีอาคารทำการของคณะฯ 3 อาคาร คือ อาคารนิเทศศาสตร์ 1 อาคารนิเทศศาสตร์ 2 และอาคารมงกุฎสมมติวงศ์ เป็นอาคารสูง 12 ชั้น เพียบพร้อมไปด้วยอุปกรณ์ทางการสื่อสารมวลชนที่ทันสมัย และอาคารพินิตประชานาถ ซึ่งเป็นอาคารเรียนส่วนกลางของมหาวิทยาลัยซึ่งใช้ร่วมกับคณะนิติศาสตร์
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-communication-arts-hero-desktop-1024x640.jpg",
  },
  {
    id: "5",
    name: "คณะพาณิชยศาสตร์และการบัญชี",
    detail: `คณะพาณิชยศาสตร์และการบัญชี จุฬาลงกรณ์มหาวิทยาลัย เริ่มต้นจากความต้องการบุคลากรด้านเศรษฐกิจในยุคที่กรมสถิติพยากรณ์อยู่ในกระทรวงพระคลังมหาสมบัติ มีการส่งนักเรียนไปศึกษาด้านเศรษฐศาสตร์ การพาณิชย์ และการบัญชีในต่างประเทศ เพื่อสนับสนุนการบริหารเศรษฐกิจของชาติ ต่อมาในปี พ.ศ. 2481 จุฬาลงกรณ์มหาวิทยาลัยได้จัดตั้ง "แผนกวิชาการบัญชีและพาณิชย์" ขึ้นภายใต้คณะอักษรศาสตร์และวิทยาศาสตร์ โดยมีศาสตราจารย์อุปการคุณ พระยาไชยยศสมบัติ เป็นหัวหน้าแผนก และพัฒนาหลักสูตรให้เหมาะสมกับการศึกษาในยุคนั้น ภายหลังในปี พ.ศ. 2486 แผนกนี้ได้รับการยกฐานะเป็น "คณะพาณิชยศาสตร์และการบัญชี" ประกอบด้วย 3 แผนกวิชา ได้แก่ การบัญชี พาณิชยศาสตร์ และเศรษฐศาสตร์ โดยพระยาไชยยศสมบัติได้รับแต่งตั้งเป็นคณบดีคนแรก ปัจจุบัน คณะพาณิชยศาสตร์และการบัญชีได้พัฒนาหลักสูตรให้สอดคล้องกับความต้องการของธุรกิจและอุตสาหกรรม รวมถึงเปิดสอนหลักสูตรนานาชาติในทุกระดับการศึกษา ในฐานะ "Chulalongkorn Business School (CBS)" ที่ได้รับการรับรองมาตรฐานระดับโลก AACSB มุ่งเน้นการผลิตบุคลากรคุณภาพเพื่อรองรับการเติบโตทางเศรษฐกิจและสังคมในระดับสากล
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-commerce-and-accountancy-hero-desktop-1024x640.jpg",
  },
  {
    id: "6",
    name: "คณะรัฐศาสตร์",
    detail: `คณะรัฐศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็นสถาบันการศึกษาที่เก่าแก่ที่สุดแห่งหนึ่งในประเทศไทย โดยก่อตั้งขึ้นครั้งแรกในปี พ.ศ. 2442 ในชื่อ "โรงเรียนสำหรับฝึกหัดวิชาข้าราชการฝ่ายพลเรือน" ตามพระราชดำริของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ต่อมาได้เปลี่ยนชื่อเป็น "โรงเรียนมหาดเล็ก" และ "โรงเรียนข้าราชการพลเรือนของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว" ก่อนจะถูกยกระดับเป็นส่วนหนึ่งของจุฬาลงกรณ์มหาวิทยาลัยในปี พ.ศ. 2459 ภายหลังการประกาศใช้พระราชบัญญัติระเบียบข้าราชการพลเรือนในปี พ.ศ. 2472 ทำให้คณะรัฐศาสตร์ถูกยุบตัวลง แต่ในปี พ.ศ. 2491 รัฐบาลเล็งเห็นความสำคัญของการศึกษาในด้านการปกครองและการบริหาร จึงได้ก่อตั้งคณะรัฐศาสตร์ขึ้นใหม่ โดยเปิดสอนหลายสาขา เช่น การปกครอง การทูต รัฐประศาสนศาสตร์ และสังคมวิทยา โดยในเวลาต่อมาบางสาขาได้พัฒนาเป็นคณะใหม่ เช่น คณะเศรษฐศาสตร์ คณะนิติศาสตร์ และคณะนิเทศศาสตร์ นอกจากนี้ คณะรัฐศาสตร์ยังเป็นต้นกำเนิดของสถาบันวิจัยและศูนย์ศึกษาหลายแห่ง เช่น สถาบันประชากรศาสตร์ และสถาบันความมั่นคงและนานาชาติ ทำให้คณะรัฐศาสตร์เป็นสถาบันที่มีบทบาทสำคัญในการพัฒนาความรู้ด้านรัฐศาสตร์และสังคมศาสตร์ของไทยมาจนถึงปัจจุบัน`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-political-science-hero-desktop-1024x640.jpg",
  },
  {
    id: "7",
    name: "คณะศิลปกรรมศาสตร์",
    detail: `ในปี พ.ศ. 2514 จุฬาลงกรณ์มหาวิทยาลัยได้เสนอโครงการจัดตั้ง "ศิลปกรรมศาสตร์" ครั้งแรกในการสัมมนาหัวหน้าแผนกวิชาเรื่อง "การพัฒนาการศึกษาของจุฬาลงกรณ์มหาวิทยาลัย" โดยมีศาสตราจารย์ ดร.สุขุม ศรีธัญญรัตน์ เป็นประธาน ซึ่งมุ่งเน้นการจัดตั้งหน่วยวิชาการด้านศิลปกรรมศาสตร์ที่ครอบคลุมสาขาวิชาศิลปะต่าง ๆ เช่น วิจิตรศิลป์ เนรมิตศิลป์ ดุริยางค์ และศิลปการแสดง เพื่อเติมเต็มช่องว่างทางวิชาการด้านศิลปะในมหาวิทยาลัย ต่อมาในปี พ.ศ. 2517 ได้มีการแต่งตั้งคณะกรรมการจัดทำโครงการศิลปกรรมศาสตร์ ภายใต้การพิจารณาของรองศาสตราจารย์ ดร.วิจิตร ศรีสอ้าน โดยโครงการดังกล่าวได้รับการบรรจุในแผนพัฒนาระยะที่ 4 (พ.ศ. 2520–2525) และมีมติให้จัดตั้งเป็น "คณะศิลปกรรมศาสตร์" ประกอบด้วย 4 ภาควิชา ได้แก่ ทัศนศิลป์ นฤมิตศิลป์ ดุริยางคศิลป์ และนาฏยศิลป์ คณะศิลปกรรมศาสตร์เริ่มเปิดการเรียนการสอนในปีการศึกษา 2526 โดยเปิดรับนิสิตในภาควิชาทัศนศิลป์และดุริยางคศิลป์ก่อน จากนั้นจึงเปิดรับนิสิตในภาควิชานฤมิตศิลป์ในปีการศึกษา 2528 และภาควิชานาฏยศิลป์ในปีการศึกษา 2531`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2017/12/faculty-of-fine-and-applied-arts-hero-desktop-1024x640.jpg",
  },
  {
    id: "8",
    name: "คณะเศรษฐศาสตร์",
    detail: `ปี พ.ศ. 2510 ศาสตราจารย์ อาภรณ์ กฤษณามระ คณบดีคณะพาณิชยศาสตร์และการบัญชีในขณะนั้น ได้ริเริ่มและเสนอโครงการยกฐานะแผนกวิชาเศรษฐศาสตร์ขึ้นเป็นคณะเศรษฐศาสตร์ต่อจุฬาลงกรณ์มหาวิทยาลัยและสภาการศึกษาแห่งชาติ แต่สภาการศึกษาแห่งชาติได้พิจารณาหลักสูตรการศึกษาของโครงการดังกล่าวแล้วมีความเห็นว่า หลักสูตรนั้นมีความคล้ายคลึงกับหลักสูตรการศึกษาของแผนกวิชาการคลัง คณะรัฐศาสตร์ อยู่มาก น่าที่จะพิจารณารวมการดำเนินงานเข้าด้วยกัน จึงส่งเรื่องมาให้จุฬาลงกรณ์มหาวิทยาลัยพิจารณาอีกครั้ง ต่อมาเมื่อปี พ.ศ. 2513 มีพระราชกฤษฎีกาจัดตั้งคณะเศรษฐศาสตร์ในจุฬาลงกรณ์มหาวิทยาลัย โดยให้เหตุผลในการประกาศใช้พระราชกฤษฎีกาฉบับดังกล่าวว่า เนื่องจากวิชาเศรษฐศาสตร์เป็นวิชาที่สำคัญและจำเป็นในการวางแผนพัฒนาประเทศประกอบกับขณะนั้น ในประเทศไทยยังขาดแคลนผู้เชี่ยวชาญทางด้านนี้จำนวนมาก การสอนวิชาเศรษฐศาสตร์ในจุฬาลงกรณ์มหาวิทยาลัยขณะนั้นได้แยกกันจัดดำเนินการโดยสองแผนกวิชา คือ แผนกวิชาเศรษฐศาสตร์ คณะพาณิชยศาสตร์และการบัญชี และแผนกวิชาการคลัง คณะรัฐศาสตร์ ให้ยุบแผนกวิชาเศรษฐศาสตร์และแผนกวิชาการคลัง แล้วจัดตั้งเป็นคณะเศรษฐศาสตร์แห่งจุฬาลงกรณ์มหาวิทยาลัย และโอนอาจารย์จากทั้ง 2 แผนกมาสังกัดคณะใหม่ โดยในขั้นแรกเปิดสอน 4 แผนกวิชา ได้แก่ เศรษฐศาสตร์ทฤษฎี เศรษฐศาสตร์พัฒนาการ เศรษฐศาสตร์การเงินและการคลัง และเศรษฐศาสตร์ระหว่างประเทศ`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-economics-hero-desktop-1024x640.jpg",
  },

  {
    id: "9",
    name: "คณะอักษรศาสตร์",
    detail: `คณะอักษรศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เดิมมีชื่อว่า "คณะอักษรศาสตร์และวิทยาศาสตร์" และเป็นหนึ่งในสี่คณะแรกที่ก่อตั้งขึ้นเมื่อวันที่ 26 มีนาคม พ.ศ. 2460 โดยสมเด็จพระเจ้าบรมวงศ์เธอ กรมพระยาชัยนาทนเรนทร ในระยะแรก การเรียนการสอนมุ่งเน้นวิชาอักษรศาสตร์และวิทยาศาสตร์สำหรับนิสิตเตรียมแพทย์ จนปี พ.ศ. 2471 ได้เปิดสอนวิชาอักษรศาสตร์ในหลักสูตร 3 ปี และปี พ.ศ. 2473 ได้เปิดสอนวิชาวิทยาศาสตร์ ในปี พ.ศ. 2476 มีการแยกคณะออกเป็น 2 คณะ แต่รวมกลับกันในปีเดียวกัน และแบ่งเป็น 9 แผนกวิชา ต่อมาในปี พ.ศ. 2477 ได้เปิดหลักสูตรอักษรศาสตรบัณฑิต และในปี พ.ศ. 2485 เปิดหลักสูตรอักษรศาสตรมหาบัณฑิต ในปี พ.ศ. 2486 คณะถูกแยกอีกครั้งและเปลี่ยนชื่อเป็น "คณะอักษรศาสตร์และครุศาสตร์" ในปี พ.ศ. 2491 แต่ยังบริหารรวมกับคณะวิทยาศาสตร์จนถึงปี พ.ศ. 2493 ก่อนแยกออกเป็นอิสระ และในปี พ.ศ. 2500 แผนกวิชาครุศาสตร์ได้รับการยกฐานะเป็นคณะครุศาสตร์ ทำให้คณะกลับมาใช้ชื่อ "คณะอักษรศาสตร์" อีกครั้ง มีการจัดตั้งแผนกวิชาใหม่ตามลำดับ เช่น แผนกวิชาบรรณารักษศาสตร์ในปี พ.ศ. 2498 แผนกวิชาปรัชญาในปี พ.ศ. 2514 และแผนกวิชาศิลปการละครในปี พ.ศ. 2515 รวมถึงการแยกแผนกวิชาภูมิศาสตร์และประวัติศาสตร์ออกจากกันในเวลาต่อมา`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-arts-hero-desktop-1024x640.jpg",
  },
  {
    id: "10",
    name: "คณะวิทยาศาสตร์",
    detail: `คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็นหนึ่งในสี่คณะเริ่มแรกของมหาวิทยาลัย ก่อตั้งขึ้นในชื่อ "คณะอักษรศาสตร์และวิทยาศาสตร์" โดยมีวัตถุประสงค์เพื่อสอนวิชาพื้นฐานทางวิทยาศาสตร์ให้นิสิตคณะแพทยศาสตร์ ต่อมาคณะแพทยศาสตร์และศิริราชพยาบาลได้ย้ายไปสังกัดมหาวิทยาลัยมหิดลในปี พ.ศ. 2486 และคณะวิทยาศาสตร์ยังคงทำหน้าที่สอนวิชาพื้นฐานให้กับคณะต่างๆ เช่น แพทยศาสตร์และวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย และผลิตครูวิทยาศาสตร์จนถึงปัจจุบัน ในปี พ.ศ. 2465 สมเด็จพระเจ้าน้องยาเธอ เจ้าฟ้ามหิดลอดุลยเดช ได้ดำเนินการขอความร่วมมือจากมูลนิธิร็อกกี้เฟลเลอร์เพื่อพัฒนาวิชาวิทยาศาสตร์และแพทยศาสตร์ โดยมูลนิธิสนับสนุนการสร้าง "ตึกขาว" เป็นอาคารวิทยาศาสตร์แห่งแรกและส่งเสริมการศึกษาในสาขาวิทยาศาสตร์ จนสามารถพัฒนาบุคลากรและขยายหลักสูตรวิทยาศาสตร์ได้สำเร็จ ในปี พ.ศ. 2491 คณะอักษรศาสตร์และวิทยาศาสตร์ได้แยกออกเป็นสองคณะอย่างชัดเจน คณะวิทยาศาสตร์จึงเป็นคณะแรกในประเทศไทยที่มีการสอนวิทยาศาสตร์ โดยเริ่มจาก 4 ภาควิชา ได้แก่ คณิตศาสตร์ เคมี ฟิสิกส์ และชีววิทยา และขยายสาขาวิชาเพื่อพัฒนาบุคลากรด้านวิทยาศาสตร์และเทคโนโลยี ซึ่งเป็นกำลังสำคัญในการพัฒนาประเทศให้ทัดเทียมนานาชาติ`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2017/12/chula-faculty-science-hero-desktop-2-1024x640.jpg",
  },
  {
    id: "11",
    name: "คณะสถาปัตยกรรมศาสตร์",
    detail: `คณะสถาปัตยกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็น 1 ใน 4 คณะกลุ่มวิทยาศาสตร์และเทคโนโลยีแห่งจุฬาลงกรณ์มหาวิทยาลัย ตั้งอยู่ติดกับถนนพญาไท แขวงปทุมวัน เขตปทุมวัน คณะสถาปัตยกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ถือเป็นคณะสถาปัตยกรรมศาสตร์แห่งแรกของประเทศไทย ก่อตั้งขึ้นเมื่อวันที่ 23 พฤษภาคม พ.ศ. 2476 ในฐานะแผนกสถาปัตยกรรมศาสตร์ สังกัดคณะวิศวกรรมศาสตร์ และได้แยกตัวมาเป็นคณะสถาปัตยกรรมศาสตร์ เมื่อปี พ.ศ. 2482
คณะสถาปัตยกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประกอบด้วย 6 ภาควิชาหลัก ได้แก่ ภาควิชาสถาปัตยกรรม ภาควิชาการออกแบบอุตสาหกรรม ภาควิชาเคหการ ภาควิชาการวางแผนภาคและเมือง ภาควิชาภูมิสถาปัตยกรรม และภาควิชาสถาปัตยกรรมภายใน
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2017/12/architecture-hero-1440x900-1024x640.jpg",
  },
  {
    id: "12",
    name: "คณะจิตวิทยา",
    detail: `คณะจิตวิทยา จุฬาลงกรณ์มหาวิทยาลัย ได้จัดตั้งขึ้นในจุฬาลงกรณ์มหาวิทยาลัย ตามพระราชกฤษฎีกา จัดตั้งคณะจิตวิทยาในจุฬาลงกรณ์มหาวิทยาลัย ณ วันที่ 7 กรกฎาคม พ.ศ. 2539 และประกาศในราชกิจจานุเบกษา ณ วันที่ 11 กรกฎาคม พ.ศ. 2539 นับเป็นคณะที่ 18 ของจุฬาลงกรณ์มหาวิทยาลัย และเป็นคณะจิตวิทยาแห่งแรกของประเทศไทย ในปี พ.ศ. 2559 คณะจิตวิทยา จุฬาลงกรณ์มหาวิทยาลัย เป็นคณะจิตวิทยา อันดับ 1 ของประเทศไทย จากการจัดอันดับของ QS World University Rankings by Subject 2016
คณะจิตวิทยามุ่งเน้นการศึกษาวิจัยเพื่อสร้างความเข้าใจเรื่องพฤติกรรมของมนุษย์ อันนำไปสู่แนวทางในการอธิบาย ทำนาย และปรับเปลี่ยนพฤติกรรม ให้สามารถดำรงชีวิตอยู่ในสังคมได้อย่างมีความสุขและยั่งยืน โดยเปิดสอนระดับปริญญาตรี ปริญญาโท และปริญญาเอก ในกลุ่มรายวิชาต่าง ๆ อาทิ จิตวิทยาการปรึกษา จิตวิทยาสังคม จิตวิทยาพัฒนาการ และจิตวิทยาการทำงานและทรัพยากรมนุษย์ รวมทั้งเปิดสอนหลักสูตรนานาชาติ สาขาวิชาวิทยาศาสตร์จิตวิทยา (Joint International Psychology Program) ในระดับปริญญาตรีด้วย`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-psychology-hero-desktop-1024x640.jpg",
  },
  {
    id: "13",
    name: "คณะทันตแพทยศาสตร์",
    detail: `การศึกษาทันตแพทยศาสตร์ในประเทศไทยเริ่มต้นเมื่อปี พ.ศ. 2471 โดยศาสตราจารย์ พันเอก ทันตแพทย์ นายแพทย์ หลวงวาจวิทยาวัฑฒน์ ได้เสนอแนวคิดการจัดตั้งโรงเรียนทันตแพทย์ในจุฬาลงกรณ์มหาวิทยาลัย แต่ไม่ได้รับความสนใจในขณะนั้น จนกระทั่งปี พ.ศ. 2479 หลวงวาจวิทยาวัฑฒน์ได้รับอนุมัติจากจอมพล ป. พิบูลสงคราม ให้เดินทางไปศึกษาการจัดตั้งโรงเรียนทันตแพทย์ในต่างประเทศ เมื่อเดินทางกลับ โครงการได้เปลี่ยนมาอยู่ในความดูแลของจุฬาลงกรณ์มหาวิทยาลัย และในวันที่ 16 พฤษภาคม พ.ศ. 2483 ได้ก่อตั้งแผนกอิสระทันตแพทยศาสตร์ โดยมีหลวงวาจวิทยาวัฑฒน์เป็นหัวหน้า มีนิสิตสำเร็จการศึกษารุ่นแรก 8 คน ต่อมาแผนกทันตแพทยศาสตร์ได้พัฒนาอย่างต่อเนื่อง ทั้งการสร้างตึกเรียน การจัดตั้งโรงพยาบาลโรคฟัน และการก่อตั้งหน่วยทันตกรรมเคลื่อนที่เพื่อดูแลสุขภาพช่องปากของประชาชนในพื้นที่ห่างไกล นอกจากนี้ ยังได้รับพระราชทานความช่วยเหลือจากพระบาทสมเด็จพระเจ้าอยู่หัว และสมเด็จพระศรีนครินทราบรมราชชนนี ในการก่อสร้างอาคารและโรงพยาบาลทันตแพทยศาสตร์ ซึ่งถือเป็นโรงพยาบาลทันตกรรมแห่งแรกในประเทศไทย ปัจจุบัน คณะทันตแพทยศาสตร์ยังคงมุ่งมั่นพัฒนาเพื่อส่งเสริมการศึกษาวิชาทันตแพทยศาสตร์และการบริการสุขภาพช่องปากแก่ประชาชนอย่างครบวงจร`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-dentistry-hero-desktop-1024x640.jpg",
  },

  {
    id: "14",
    name: "คณะพยาบาลศาสตร์",
    detail: `ภาควิชาพยาบาลศึกษาเริ่มจัดการเรียนการสอนในปี พ.ศ. 2501 ภายใต้คณะครุศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย โดยความร่วมมือกับกองการพยาบาลและสำนักงานปลัดกระทรวงสาธารณสุข เพื่อแก้ปัญหาการขาดแคลนครูพยาบาลและพยาบาลวิชาชีพ ซึ่งได้รับการสนับสนุนด้านอุปกรณ์และทุนจากองค์การอนามัยโลก (WHO) และ UNICEF ต่อมาในปี พ.ศ. 2516 ได้เปิดหลักสูตรปริญญาโทด้านการพยาบาลเป็นครั้งแรกในประเทศไทย และในปี พ.ศ. 2531 ได้มีการจัดตั้งคณะพยาบาลศาสตร์อย่างเป็นทางการ โดยมีพระราชกฤษฎีกาจากพระบาทสมเด็จพระเจ้าอยู่หัวรัชกาลที่ 9 ประกาศในราชกิจจานุเบกษา คณะพยาบาลศาสตร์ยังมีบทบาทสำคัญในวงการพยาบาล โดยในปี พ.ศ. 2548 และ พ.ศ. 2552 ศาสตราจารย์ ดร.ประนอม โอทกานนท์ ได้รับตำแหน่งคณบดีและคณะกรรมการสภาการพยาบาลตามลำดับ นอกจากนี้ในปี พ.ศ. 2553 ศาสตราจารย์ ดร.วีณา จีระแพทย์ ยังได้รับรางวัลพยาบาลดีเด่นสาขาการวิจัยจากสภาการพยาบาลแห่งประเทศไทย และมีบทบาทเป็นที่ปรึกษาองค์การอนามัยโลกในภูมิภาคเอเชียตะวันออกเฉียงใต้`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-nursing-hero-desktop-1024x640.jpg",
  },
  {
    id: "15",
    name: "คณะแพทยศาสตร์",
    detail: `คณะแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ก่อตั้งเมื่อวันที่ 22 พฤษภาคม พ.ศ. 2490 โดยมีผลบังคับใช้ในวันที่ 4 มิถุนายน พ.ศ. 2490 เป็นคณะแพทยศาสตร์แห่งที่ 2 ของประเทศไทย กำเนิดขึ้นจากพระราชปรารภในพระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล รัชกาลที่ 8 เพื่อตอบสนองความต้องการด้านสาธารณสุขหลังสงครามโลกครั้งที่ 2 ปัจจุบันเป็นศูนย์ความร่วมมือขององค์การอนามัยโลกใน 3 สาขา ได้แก่ แพทยศาสตรศึกษา การวิจัยการสืบพันธุ์ของมนุษย์ และการวิจัยโรคติดต่อจากสัตว์สู่คน คณะทำงานร่วมกับโรงพยาบาลจุฬาลงกรณ์ สภากาชาดไทย ในการผลิตบัณฑิต การวิจัย พัฒนาความรู้ทางการแพทย์ และให้บริการทางการแพทย์แก่ประชาชน มีภาควิชาทั้งหมด 22 ภาควิชาและหน่วยงานภายใน 12 หน่วยงาน โดยคณบดีคณะแพทยศาสตร์และผู้อำนวยการโรงพยาบาลจุฬาลงกรณ์เป็นบุคคลคนเดียวกัน ที่ตั้งอยู่ในเขตปทุมวัน กรุงเทพมหานคร ใกล้ศูนย์กลางธุรกิจ การเงิน และการทูตของประเทศ การเดินทางสะดวกผ่านรถยนต์ส่วนตัว รถโดยสารประจำทาง รถไฟฟ้าบีทีเอส รถไฟฟ้ามหานคร และรถโดยสารภายในจุฬาลงกรณ์มหาวิทยาลัย`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-medicine-hero-desktop-1024x640.jpg",
  },
  {
    id: "16",
    name: "คณะเภสัชศาสตร์",
    detail: `คณะเภสัชศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็นคณะเภสัชศาสตร์แห่งแรกในประเทศไทย ก่อตั้งเมื่อวันที่ 8 ธันวาคม พ.ศ. 2456 โดยมีจุดเริ่มต้นจาก "แผนกแพทย์ผสมยา โรงเรียนราชแพทยาลัย" หรือ "โรงเรียนปรุงยา" ตามดำริของสมเด็จพระอนุชาธิราช เจ้าฟ้าจักรพงษ์ภูวนาถ และสมเด็จพระเจ้าบรมวงศ์เธอ กรมพระยาชัยนาทนเรนทร ซึ่งถือเป็นวันสถาปนาวิชาชีพเภสัชกรรมในประเทศไทย ต่อมามีการพัฒนาเป็นแผนกเภสัชกรรมศาสตร์ และมีการเปลี่ยนแปลงสังกัดหลายครั้ง ก่อนจะกลับมาสังกัดจุฬาลงกรณ์มหาวิทยาลัยในปี พ.ศ. 2482 และย้ายมาที่อาคารปัจจุบันบริเวณสยามสแควร์ในปี พ.ศ. 2525 ปัจจุบันคณะเปิดสอนในระดับปริญญาตรี ปริญญาโท และปริญญาเอก โดยระดับปริญญาตรีมี 2 หลักสูตร ได้แก่ เภสัชศาสตรบัณฑิต สาขาวิชาการบริบาลทางเภสัชกรรม และสาขาวิชาเภสัชศาสตร์ ซึ่งใช้เวลาเรียน 6 ปี คณะยังส่งเสริมความร่วมมือระหว่างประเทศผ่านโครงการแลกเปลี่ยนนิสิตและคณาจารย์กับมหาวิทยาลัยต่าง ๆ เช่น สหรัฐอเมริกา สหราชอาณาจักร ญี่ปุ่น และเกาหลีใต้`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-pharmaceutical-sciences-hero-desktop-01-1024x640.jpg",
  },
  {
    id: "17",
    name: "คณะสหเวชศาสตร์",
    detail: `คณะสหเวชศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย มีประวัติความสืบเนื่องจากการเปิดสอนหลักสูตรเทคนิคการแพทย์ของโรงเรียนเทคนิคการแพทย์ มหาวิทยาลัยแพทยศาสตร์ (ปัจจุบัน คือ คณะเทคนิคการแพทย์ มหาวิทยาลัยมหิดล) ณ โรงพยาบาลจุฬาลงกรณ์ สภากาชาดไทย เมื่อปี พ.ศ. 2502 ซึ่งต่อมาได้มีการโอนคณะเทคนิคการแพทย์ มหาวิทยาลัยมหิดลในส่วนที่ตั้งอยู่ภายในโรงพยาบาลจุฬาลงกรณ์มาสังกัดแผนกวิชาเวชศาสตร์ชันสูตร คณะแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ในปี พ.ศ. 2514 และมีการพัฒนาขึ้นเป็นภาควิชาเทคนิคการแพทย์ คณะแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย จนกระทั่ง จัดตั้งเป็นคณะสหเวชศาสตร์เมื่อวันที่ 16 พฤศจิกายน พ.ศ. 2534 ซึ่งนับเป็นคณะลำดับที่ 17 ของจุฬาลงกรณ์มหาวิทยาลัยและถือเป็นคณะสหเวชศาสตร์แห่งแรกของประเทศไทย โดยมีหน้าที่ในการผลิตบัณฑิตสาขาวิชาในกลุ่มวิทยาศาสตร์สุขภาพต่าง ๆ ทั้งเทคนิคการแพทย์ กายภาพบำบัด และรังสีเทคนิคเป็นต้น
ปัจจุบัน คณะสหเวชศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เปิดสอนหลักสูตรระดับปริญญาบัณฑิตใน 4 สาขาวิชา ได้แก่ สาขาวิชาเทคนิคการแพทย์ สาขาวิชากายภาพบำบัด สาขาวิชาโภชนาการและการกำหนดอาหาร และสาขาวิชารังสีเทคนิค นอกจากนี้ยังเปิดสอนในระดับบัณฑิตศึกษา แบ่งเป็น ระดับปริญญาโท 5 สาขาวิชาและระดับปริญญาเอก 5 สาขาวิชา
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-allied-health-sciences-hero-desktop-1024x640.jpg",
  },
  {
    id: "18",
    name: "คณะวิทยาศาสตร์การกีฬา",
    detail: `การฝึกหัดร่างกายและการกีฬาในสยามเริ่มต้นจากการฝึกศิลปะป้องกันตัวและการแสดง ใช้ทั้งความอ่อนตัวและความแข็งแกร่ง จนกระทั่งรัชกาลที่ 5 มีการบรรจุ "วิชากายกรรม" และ "วิชาดัดตน" ในหลักสูตรการศึกษาฉบับแรก (พ.ศ. 2441) และได้รับการส่งเสริมต่อเนื่องโดยเจ้าพระยาธรรมศักดิ์มนตรี ผู้ริเริ่มพลศึกษาในโรงเรียนฝึกหัดครูและสร้างตำรา รวมถึงเพลง "กราวกีฬา" ในรัชกาลที่ 6 การกีฬาเจริญรุ่งเรืองมากขึ้น โดยเฉพาะฟุตบอลและเทนนิส และในปี พ.ศ. 2462 มีการก่อตั้ง "โรงเรียนพลศึกษากลาง"
เมื่อจุฬาลงกรณ์มหาวิทยาลัยจัดตั้งคณะครุศาสตร์ใน พ.ศ. 2500 ได้มีการเปิด "แผนกพลศึกษา" เพื่อผลิตบุคลากรด้านพลศึกษา การกีฬา และนันทนาการ การพัฒนานี้นำไปสู่การก่อตั้ง "สำนักวิชาวิทยาศาสตร์การกีฬา" ใน พ.ศ. 2541 และเปลี่ยนชื่อเป็น "คณะวิทยาศาสตร์การกีฬา" ในปี พ.ศ. 2552 โดยสมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดาฯ เสด็จพระราชดำเนินเปิดป้ายนามคณะในปี พ.ศ. 2553
ปัจจุบัน คณะวิทยาศาสตร์การกีฬาเป็นแหล่งวิจัยและพัฒนานวัตกรรมด้านการออกกำลังกาย สุขภาพ และการจัดการกีฬาในระดับเอเชีย เปิดสอนตั้งแต่ระดับปริญญาตรีจนถึงดุษฎีบัณฑิต ครอบคลุมแขนงวิทยาการส่งเสริมสุขภาพ วิทยาศาสตร์และเทคโนโลยีการกีฬา และการบริหารจัดการกีฬาและนันทนาการ
`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-sports-science-hero-desktop-1024x640.jpg",
  },
  {
    id: "19",
    name: "คณะสัตวแพทยศาสตร์",
    detail: `คณะสัตวแพทยศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เป็นคณะสัตวแพทยศาสตร์แห่งแรกของประเทศไทย ก่อตั้งขึ้นในปี พ.ศ. 2478 โดยมีพันธกิจหลักในการเรียนการสอน การวิจัย และบริการวิชาการด้านสัตวแพทย์ ปัจจุบันเปิดสอนหลักสูตรสัตวแพทยศาสตรบัณฑิต (สพ.บ.) และหลักสูตรระดับบัณฑิตศึกษา 25 หลักสูตร ได้แก่ ประกาศนียบัตรบัณฑิตทางวิทยาศาสตร์ทางสัตวแพทย์คลินิก 7 แขนงวิชา ปริญญามหาบัณฑิต 10 สาขาวิชา และปริญญาดุษฎีบัณฑิต 6 สาขาวิชา รวมถึงหลักสูตรนานาชาติ คณะฯ มุ่งมั่นผลิตบุคลากรที่มีความรู้ ความสามารถ และคุณธรรม พร้อมสร้างผลงานวิจัยที่เป็นประโยชน์ต่อสังคมและประเทศอย่างยั่งยืน`,
    image:
      "https://www.chula.ac.th/wp-content/uploads/2018/01/chula-faculty-veterinary-science-hero-desktop-1024x640.jpg",
  },
];

export default FacultyDetails;
